<?php

namespace Database\Seeders;

use App\Models\Faq;
use Illuminate\Database\Seeder;

class FaqSeeder extends Seeder
{
    public function run(): void
    {
        $faqs = [
            [
                'question_ru' => 'Что такое JUMYSTAP?',
                'question_kz' => 'JUMYSTAP дегеніміз не?',
                'answer_ru' => [
                    'JUMYSTAP – это сервисная площадка, которая дает возможность:',
                    '<b>Выпускникам</b> проекта JOLTAP – <u>найти заказы или вакансию с подходящим графиком работы;</u><br>',
                    '<b>Работодателям</b> –  найти квалифицированного исполнителя или сотрудника.<br>',
                    '<b>Заказчикам</b> – найти исполнителя заказа для объема работы.',
                ],
                'answer_kz' => [
                    'JUMYSTAP – бұл қызмет көрсету алаңы, ол мүмкіндіктер береді:',
                    '<b>JOLTAP жобасының түлектері</b> – <u>жұмыс кестесімен сәйкес келетін тапсырыстарды немесе жұмыс орнын табу;</u><br>',
                    '<b>Жұмыс берушілерге</b> – білікті орындаушыны немесе қызметкерді табу.<br>',
                    '<b>Тапсырыс берушілерге</b> – жұмыс көлемі үшін орындаушыны табу.',
                ],
            ],
            [
                'question_ru' => 'Как пройти регистрацию?',
                'question_kz' => 'Тіркеуден қалай өтуге болады?',
                'answer_ru' => [
                    'Выпускникам:',
                    'Нажмите на “Вход”',
                    'Далее нажмите “Зарегистрируйтесь”',
                    'Выберите “Я ищу работу или заказ”',
                    'Заполните форму регистрации',
                    'Загрузите фотографию',
                    'Заполните информацию о сертификате',
                    'Выберите вид работы и статус поиска',
                    'После нажмите “Завершить регистрацию”',
                ],
                'answer_kz' => [
                    'Түлектерге:',
                    '“Кіру” түймесін басыңыз',
                    'Содан кейін “Тіркелу” түймесін басыңыз',
                    '“Мен жұмыс немесе тапсырыс іздеймін” опциясын таңдаңыз',
                    'Тіркеу формасын толтырыңыз',
                    'Фотосуретті жүктеңіз',
                    'Сертификат туралы ақпаратты толтырыңыз',
                    'Жұмыс түрі мен іздеу мәртебесін таңдаңыз',
                    'Содан кейін “Тіркеуді аяқтау” түймесін басыңыз',
                ],
            ],
            [
                'question_ru' => 'Что требуется от выпускника?',
                'question_kz' => 'Түлектерден не талап етіледі?',
                'answer_ru' => [
                    '– <b>Фото и портфолио.</b> Работодатели и заказчики будут видеть ваши работы. Наличие портфолио увеличивает ваши шансы в несколько раз.',
                    '– <b>Сертификат проекта JOLTAP.</b> Модераторы подтвердят ваш номер и дату сертификата.',
                    '– <b>Контактные данные.</b> Работодатели и заказчики смогут писать вам в WhatsApp для обсуждения сотрудничества.',
                ],
                'answer_kz' => [
                    '– <b>Фото және портфолио.</b> Жұмыс берушілер мен тапсырыс берушілер сіздің жұмыстарыңызды көреді. Портфолионың болуы сіздің мүмкіндіктеріңізді бірнеше есе арттырады.',
                    '– <b>JOLTAP жобасының сертификаты.</b> Модераторлар сіздің сертификат нөмірі мен күнін растайды.',
                    '– <b>Байланыс деректері.</b> Жұмыс берушілер мен тапсырыс берушілер сізбен WhatsApp арқылы хабарласа алады.',
                ],
            ],
            [
                'question_ru' => 'Как откликнуться на вакансию/заказ?',
                'question_kz' => 'Вакансияға/тапсырысқа қалай жауап беруге болады?',
                'answer_ru' => [
                    'Перейдите на страницу “Для выпускников”',
                    'Для удобства поиска вы можете фильтровать все объявления',
                    'Выберите интересующую вас вакансию/заказ',
                    'Нажмите на кнопку “Связаться”',
                    'Вас автоматически направят на чат с работодателем в WhatsApp.',
                ],
                'answer_kz' => [
                    '“Түлектер үшін” бетіне өтіңіз',
                    'Барлық хабарландыруларды ыңғайлы іздеу үшін сүзгіден өткізуге болады',
                    'Қызықтыратын вакансияны/тапсырысты таңдаңыз',
                    '“Байланыс” түймесін басыңыз',
                    'Сіз автоматты түрде жұмыс берушімен WhatsApp чатында боласыз.',
                ],
            ],
            [
                'question_ru' => 'Как работодателю разместить объявление?',
                'question_kz' => 'Жұмыс беруші қалай хабарландыру орналастыра алады?',
                'answer_ru' => [
                    'Зайдите в личный кабинет',
                    'Далее нажмите на “Создать объявление”',
                    'После чего выберите тип объявления',
                    'Заполните форму объявления',
                    'После заполнения нажмите на “Сохранить”',
                ],
                'answer_kz' => [
                    'Жеке кабинетке кіріңіз',
                    'Содан кейін “Хабарландыру қосу” түймесін басыңыз',
                    'Содан кейін хабарландыру түрін таңдаңыз',
                    'Хабарландыру формасын толтырыңыз',
                    'Толтырғаннан кейін “Сақтау” түймесін басыңыз',
                ],
            ],
            [
                'question_ru' => 'Как заказчику разместить объявление?',
                'question_kz' => 'Тапсырыс беруші қалай хабарландыру орналастыра алады?',
                'answer_ru' => [
                    'Зайдите в личный кабинет',
                    'Далее нажмите на “Создать объявление”',
                    'После чего выберите тип объявления',
                    'Заполните форму объявления',
                    'После заполнения нажмите на “Сохранить”',
                ],
                'answer_kz' => [
                    'Жеке кабинетке кіріңіз',
                    'Содан кейін “Хабарландыру қосу” түймесін басыңыз',
                    'Содан кейін хабарландыру түрін таңдаңыз',
                    'Хабарландыру формасын толтырыңыз',
                    'Толтырғаннан кейін “Сақтау” түймесін басыңыз',
                ],
            ],
            [
                'question_ru' => 'Как связаться с выпускником и предложить ему вакансию/заказ?',
                'question_kz' => 'Түлекпен қалай байланысуға және оған вакансия/тапсырыс ұсынуға болады?',
                'answer_ru' => [
                    'Перейдите на страницу выпускника',
                    'Нажмите на кнопку “Связаться”',
                    'Вас автоматически направят на чат с выпускником в WhatsApp.',
                ],
                'answer_kz' => [
                    'Түлек бетіне өтіңіз',
                    '“Байланыс” түймесін басыңыз',
                    'Сіз автоматты түрде түлекпен WhatsApp чатында боласыз.',
                ],
            ],
            [
                'question_ru' => 'Что делать, если возникнут вопросы или проблемы при использовании платформы JUMYSTAP?',
                'question_kz' => 'JUMYSTAP платформасын пайдаланған кезде сұрақтар немесе мәселелер туындаса не істеу керек?',
                'answer_ru' => [
                    'Если у вас возникнут вопросы или проблемы при использовании платформы JUMYSTAP, вы можете обратиться в наш колл-центр для получения помощи. Наши специалисты готовы ответить на ваши вопросы, предоставить необходимую информацию и помочь в решении любых возникших проблем.',
                    'Контактные данные колл-центра:',
                    'Телефон:+7 707 221 31 31',
                    'Время работы: с Пн по Сб 10:00-19:00',
                ],
                'answer_kz' => [
                    'Егер сізде JUMYSTAP платформасын пайдаланған кезде сұрақтар немесе мәселелер туындаса, біздің колл-центрге хабарласыңыз. Біздің мамандар сіздің сұрақтарыңызға жауап береді, қажетті ақпаратты ұсынады және кез келген туындаған мәселелерді шешуге көмектеседі.',
                    'Колл-центрдің байланыс деректері:',
                    'Телефон: +7 707 221 31 31',
                    'Жұмыс уақыты: Дс-Сб 10:00-19:00',
                ],
            ],
        ];

        foreach ($faqs as $index => $faq) {
            Faq::updateOrCreate(
                ['question_ru' => $faq['question_ru']],
                array_merge($faq, ['sort_order' => $index + 1, 'is_active' => true]),
            );
        }
    }
}
