<?php

return [
    'limit'          => 'Вы превысили количество попыток по верификации.',
    'after'          => 'Повторный код верификации вы можете запросить через :estimated_seconds секунд.',
    'sent'           => 'Код подтверждения отправлен.',
    'success'        => 'Верификация прошла успешно.',
    'error'          => 'Ошибка верификации.',
    'sms_send_error' => 'Ошибка при отправке СМС.',
    'code_expired' => 'Код подтверждения устарел, запросите новый для подтверждения.',
    'user_not_registered' => 'По указанным данным пользователь не зарегистрирован.',
    'user_already_registered' => 'По указанным данным пользователь уже зарегистрирован.',

];
