<?php

return [
    'limit' => 'Сіз растау әрекеттерінің шекті санынан асып кеттіңіз.',
    'after' => 'Қайта растау кодын :estimated_seconds секундтен кейін сұрай аласыз.',
    'sent'  => 'Растау коды жіберілді.',
    'success' => 'Верификация сәтті өтті.',
    'error'   => 'Верификация қатесі.',
    'sms_send_error' => 'SMS жіберу кезінде қате пайда болды.',
    'code_expired' => 'Растау кодының мерзімі өтіп кетті, растау үшін жаңасын сұратыңыз.',
    'user_not_registered' => 'Көрсетілген деректер бойынша пайдаланушы тіркелмеген.',
    'user_already_registered' => 'Көрсетілген деректер бойынша пайдаланушы тіркелген.',

];
