import GuestLayout from "@/Layouts/GuestLayout";

export default function Terms() {
    return (
        <GuestLayout>
            <div className="terms-container gap-y-3">
                <h1>Пользовательское соглашение об использовании платформы JUMYSTAP</h1>
                <p><strong>Действующее с 10 июля 2024 года</strong></p>

                <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
                <p>1.1. Настоящее Пользовательское соглашение об использовании платформы JUMYSTAP (далее – Соглашение) регулирует отношения по использованию платформы JUMYSTAP (jumystap.kz) физическими и (или) юридическими лицами.</p>
                <p>1.2. В настоящем Соглашении используются следующие понятия:</p>
                <ul>
                    <li>Платформа JUMYSTAP (jumystap.kz) – Веб-сайт (Сервис) доступная по адресу jumystap.kz (далее – Портал);</li>
                    <li>Пользователь – физическое или юридическое лицо, принявшее условия настоящего Соглашения;</li>
                    <li>Администратор Портала (далее – Администратор) – работники Общественного фонда «Жаңа мүмкіндік», осуществляющие методологическое, техническое сопровождение и системно-техническое обслуживание Портала;</li>
                    <li>Учетная запись (аккаунт) – набор данных, хранящихся в программном обеспечении и (или) системе Портала, содержащих сведения, необходимые для идентификации Пользователя в целях предоставления ему доступа;</li>
                    <li>Владелец Портала – Общественный фонд «Жаңа мүмкіндік» (далее – Общественный фонд);</li>
                    <li>Руководство пользователя - документ, содержащий правила, указания или руководства, устанавливающие порядок и способ выполнения или осуществления каких-либо действий на Портале.</li>
                </ul>
                <p>1.3. Настоящее Соглашение является публичным договором-офертой (предложением) согласно пункту 5 статьи 395 Гражданского кодекса Республики Казахстан и регулирует отношения, возникающие при пользовании Портала.</p>
                <p>1.4. Администратор оставляет за собой право в любое время изменять, добавлять или удалять пункты настоящего Соглашения без уведомления Пользователя. Новая редакция настоящего Соглашения вступает в силу с момента ее опубликования на Портале.</p>

                <h2>2. ПРЕДМЕТ СОГЛАШЕНИЯ</h2>
                <p>2.1. Предметом настоящего Соглашения является предоставление Пользователю доступа к содержащимся на Портале информации и урегулирование взаимоотношений по оказанию услуг и сервисов Портала.</p>

                <h2>3. РЕГИСТРАЦИЯ ПОЛЬЗОВАТЕЛЯ</h2>
                <p>3.1. Использование некоторых сервисов, специально разработанных для Пользователей доступно только после регистрации на Портале. Пользователь при регистрации на Портале обязан указать принадлежащий ему личный номер мобильного телефона или электронная почта.</p>
                <p>3.2. При регистрации, Пользователю присваивается логин указанный номер мобильного телефона или электронная почта и пароль, которая используется в дальнейшем Пользователем при работе с Порталом. Пользователь может пройти процедуру регистрации только один раз.</p>
                <p>3.3. При авторизации на Портале у пользователя может запрашиваться персональные данные и дополнительная информация для подтверждения личности.</p>
                <p>3.4. Восстановление пароля Пользователя осуществляется при помощи номера мобильного телефона или электронной почтой, указанного при регистрации.</p>
                <p>3.5. При Регистрации Пользователь выражает свое согласие с настоящим Соглашением и принимает на себя указанные в нем права и обязанности, связанные с использованием и функционированием Портала.</p>
                <p>3.6. Доступ пользователя к изменению личной информации, содержащейся в профиле, производится на основе уникального логина (номера мобильного телефона или электронной почтой) и пароля, введенных Пользователем при регистрации.</p>
                <p>3.7. Вся информация, размещенная на Портале, доступна для уточнения и дальнейшего использования Общественным фондом.</p>
                <p>3.8. Все данные, размещенные на Портале, является общедоступными, за исключением пароля для доступа к личному разделу пользователя и персональных данных пользователей. Персональные данные пользователей доступны только авторизованным на Портале пользователям.</p>

                <h2>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
                <p>4.1. Пользователь вправе:</p>
                <ul>
                    <li>Получать доступ к использованию Портала при условии соблюдения условий настоящего Соглашения;</li>
                    <li>Пользоваться Порталом для получения услуг;</li>
                    <li>Менять логин и (или) пароль для доступа к Учетной записи;</li>
                    <li>Осуществлять иные права, не запрещенные законодательством Республики Казахстан;</li>
                    <li>Получить консультационную и практическую помощь от Администратора в части пользования Порталом.</li>
                </ul>
                <p>4.2. Пользователь обязуется:</p>
                <ul>
                    <li>Предоставить Администратору достоверную, точную и полную информацию по пунктам, предлагаемым в форме регистрации на Портале. Любые сомнения Администратора о недостоверности информации, предоставленной Пользователем, влекут за собой отказ в регистрации, временную блокировку и (или) удаление Учетной записи Пользователя;</li>
                    <li>Не выдавать себя за другое физическое или юридическое лицо;</li>
                    <li>Сохранить в тайне уникальный логин и пароль, используемые для доступа в Учетную запись. Логин и пароль Учетной записи, являются конфиденциальной информацией и не подлежат разглашению, за исключением случаев, предусмотренных действующим законодательством Республики Казахстан. Любые риски, связанные с утерей Пользователем пароля и логина собственной Учетной записи, Пользователь несет самостоятельно;</li>
                    <li>Периодически знакомиться на Портале с содержанием настоящего Соглашения в целях ознакомления с изменениями, внесенными согласно пункту 1.4. раздела 1 настоящего Соглашения;</li>
                    <li>Не размещать на Портале:
                        <ul>
                            <li>информацию, которую Пользователь не имеет права делать публичной по закону или согласно каким-либо договорным отношениям;</li>
                            <li>информацию, нарушающую действующее законодательство, честь и достоинство, права и охраняемые законом интересы третьих лиц;</li>
                            <li>информацию, которая нарушает авторские и (или) смежные права собственности;</li>
                            <li>информацию оскорбительного содержания, а также пропагандирующую дискриминацию людей по какому-либо признаку, насилие, ненависть;</li>
                            <li>информацию и (или) ссылки на материалы, содержащие вирусы или другое вредоносное программное обеспечение.</li>
                        </ul>
                    </li>
                    <li>соблюдать иные требования и выполнять иные обязательства, предусмотренные настоящим Соглашением и нормативными правовыми актами Республики Казахстан;</li>
                    <li>не использовать сервисы Портала с целью:
                        <ul>
                            <li>Загрузки контента, который является незаконным, нарушает любые права третьих лиц, пропагандирует насилие, жестокость, ненависть и (или) дискриминацию по расовому, национальному, половому, религиозному, социальному признакам и содержит недостоверные сведения и (или) оскорбления в адрес конкретных лиц, организаций, органов власти;</li>
                            <li>Побуждения к совершению противоправных действий, а также содействия лицам, действия которых направлены на нарушение ограничений и запретов, действующих на территории Республики Казахстан;</li>
                            <li>Нарушения прав несовершеннолетних лиц и (или) причинение им вреда в любой форме;</li>
                            <li>Представления себя за другого человека или представителя организации и (или) сообщества без достаточных на то прав, в том числе за работников Портала;</li>
                            <li>Сознательного введения в заблуждение и/или обмана Пользователей Портала.</li>
                        </ul>
                    </li>
                </ul>
                <p>4.3. Администратор вправе:</p>
                <ul>
                    <li>Изменять функционал и интерфейс Портала в любое время;</li>
                    <li>Ограничивать или приостанавливать доступ Пользователя к Порталу в случае нарушения условий настоящего Соглашения;</li>
                    <li>В любой момент приостановить или прекратить работу Портала по техническим причинам, в том числе, в целях проведения технического обслуживания;</li>
                    <li>Принимать любые меры по защите Портала от несанкционированного доступа и (или) использования;</li>
                    <li>Удалять или ограничивать доступ к информации, размещенной на Портале, если она нарушает требования действующего законодательства Республики Казахстан;</li>
                    <li>Вносить изменения в настоящие условия Соглашения.</li>
                </ul>
                <p>4.4. Администратор обязуется:</p>
                <ul>
                    <li>Обеспечить техническую возможность доступа Пользователя к Порталу;</li>
                    <li>Предоставить Пользователю возможность зарегистрироваться и получить доступ к Порталу при выполнении условий настоящего Соглашения;</li>
                    <li>Предоставлять консультационную помощь по вопросам, связанным с использованием Портала;</li>
                    <li>Соблюдать конфиденциальность данных Пользователя.</li>
                </ul>

                <h2>5. ПРАВА И ОБЯЗАННОСТИ ПОЛЬЗОВАТЕЛЯ</h2>
                <p>5.1. Пользователь обязуется:</p>
                <ul>
                    <li>Не использовать Портал в противоречии с законодательством Республики Казахстан;</li>
                    <li>Не размещать, не передавать и не распространять на Портале материалы и контент, который нарушает права третьих лиц, является незаконным или вредоносным;</li>
                    <li>Не создавать ложные Учетные записи и не использовать чужие Учетные записи;</li>
                    <li>Своевременно выполнять обязательства перед другими Пользователями Портала.</li>
                </ul>
                <p>5.2. Пользователь имеет право:</p>
                <ul>
                    <li>Использовать Портал в соответствии с его назначением и условиями настоящего Соглашения;</li>
                    <li>Получать доступ к функционалу Портала и использовать предоставленные возможности;</li>
                    <li>Обращаться за помощью к Администратору по вопросам, связанным с использованием Портала.</li>
                </ul>

                <h2>6. ПРАВО И ПРАКТИКА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
                <p>6.1. При регистрации и использовании Портала Пользователь предоставляет свои персональные данные и соглашается на их обработку в рамках предоставления услуг, предусмотренных настоящим Соглашением.</p>
                <p>6.2. Обработка персональных данных осуществляется в соответствии с законодательством Республики Казахстан о персональных данных и их защите.</p>

                <h2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
                <p>7.1. Администратор не несет ответственности за:</p>
                <ul>
                    <li>Убытки Пользователя, возникшие в результате использования Портала;</li>
                    <li>Неправомерные действия третьих лиц, осуществленные в отношении Пользователя;</li>
                    <li>Качество и содержание материалов и информации, размещенных Пользователями на Портале.</li>
                </ul>
                <p>7.2. Пользователь несет ответственность за:</p>
                <ul>
                    <li>Нарушение условий настоящего Соглашения;</li>
                    <li>Нарушение прав и интересов третьих лиц;</li>
                    <li>Убытки, возникшие в результате неправомерного использования Портала.</li>
                </ul>

                <h2>8. ПРАВО ПРИМЕНЕНИЕ</h2>
                <p>8.1. Настоящее Соглашение регулируется законодательством Республики Казахстан.</p>
                <p>8.2. Все споры и разногласия, возникающие в связи с настоящим Соглашением, разрешаются в соответствии с законодательством Республики Казахстан.</p>

                <h2>9. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
                <p>9.1. Настоящее Соглашение является публичной офертой и действительным до момента его отмены или изменения.</p>
                <p>9.2. Открытие и использование Портала, а также согласие с условиями настоящего Соглашения автоматически принимается Пользователем.</p>
            </div>
        </GuestLayout>
    );
}

